**step-1 import packages**

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

**step-2 create a data frame using list**

In [3]:
l=['shohaib','ramesh','suresh','sathish','mahesh']
#pd.DataFrame(data,index,columns)
pd.DataFrame(l)

         0
0  shohaib
1   ramesh
2   suresh
3  sathish
4   mahesh

In [4]:
l=['shohaib','ramesh','suresh','sathish','mahesh']
#pd.DataFrame(data,index,columns)
idx=['A','B','C','D','E']
pd.DataFrame(l,idx)

         0
A  shohaib
B   ramesh
C   suresh
D  sathish
E   mahesh

In [6]:
l=['shohaib','ramesh','suresh'],['sathish','mahesh']
#pd.DataFrame(data,index,columns)
idx=['A','B','C'],['D','E']
pd.DataFrame(l,idx)

                 0       1       2
[A, B, C]  shohaib  ramesh  suresh
[D, E]     sathish  mahesh    None

**step-3 want to change the index**

In [7]:
l=['shohaib','ramesh','suresh'],['sathish','mahesh']
#pd.DataFrame(data,index,columns)
idx=['A','B','C'],['D','E']
cols=[1,2,3]
pd.DataFrame(l,idx,cols)

                 1       2       3
[A, B, C]  shohaib  ramesh  suresh
[D, E]     sathish  mahesh    None

**step-4 add the columns**

In [8]:
l=['shohaib','ramesh','suresh'],['sathish','mahesh']
#pd.DataFrame(data,index,columns)
cols=[1,2,3]
pd.DataFrame(l,columns=cols)

         1       2       3
0  shohaib  ramesh  suresh
1  sathish  mahesh    None

In [9]:
l=['shohaib','ramesh','suresh'],['sathish','mahesh']
#pd.DataFrame(data,index,columns)
idx=['names','names']
cols=[1,2,3]
pd.DataFrame(l,idx,cols)

             1       2       3
names  shohaib  ramesh  suresh
names  sathish  mahesh    None

In [10]:
names,age=['ramesh','suresh','mahesh'],[20,21,22]
idx=[1,2,3]
pd.DataFrame(names,age,idx)

ValueError: Shape of passed values is (3, 1), indices imply (3, 3)

In [15]:
names=['ramesh','suresh','mahesh']
age=[20,21,22]
city=['hyd','chennai','mumbai']
cols=['name','age','city']
indx=[1,2,3]
df=pd.DataFrame(zip(names,age,city),indx,columns=cols)
df

     name  age     city
1  ramesh   20      hyd
2  suresh   21  chennai
3  mahesh   22   mumbai

**step-7 add a new columns to already existed data frame**

- in above first we have taken data

- then create a df

- now we want to add new data based on requirement

In [16]:
l=['Telangana','Tamil Nadu','Maharastra']
df['state']=l
df

     name  age     city       state
1  ramesh   20      hyd   Telangana
2  suresh   21  chennai  Tamil Nadu
3  mahesh   22   mumbai  Maharastra

In [19]:
m=[20,25,45]
df['marks']=m
df

     name  age     city       state  marks
1  ramesh   20      hyd   Telangana     20
2  suresh   21  chennai  Tamil Nadu     25
3  mahesh   22   mumbai  Maharastra     45

**step-8 update the columns with new values**

In [20]:
df

     name  age     city       state  marks
1  ramesh   20      hyd   Telangana     20
2  suresh   21  chennai  Tamil Nadu     25
3  mahesh   22   mumbai  Maharastra     45

In [24]:
df['name']=['shohaib','suhi','suuui']

In [25]:
df

      name  age     city       state  marks    names
1  shohaib   20      hyd   Telangana     20  shohaib
2     suhi   21  chennai  Tamil Nadu     25     suhi
3    suuui   22   mumbai  Maharastra     45    suuui

**step-9 create a empty data frame add add the columns**

In [6]:
df=pd.DataFrame()
df['name']=['ramesh','suresh','sathish']
df['age']=[20,30,40]
df['state']=['AP','TN','MH']
df['city']=['vizag','madhurai','nagpur']
df

      name  age state      city
0   ramesh   20    AP     vizag
1   suresh   30    TN  madhurai
2  sathish   40    MH    nagpur

**step-10 create a df using dict**

In [5]:
d={'names':['shohaib','yuvaraj','gowwwwm'],
  'age':[20,30,40],
  'state':['AP','TN','MH'],
  'cgpa':[90,68,45]}
df=pd.DataFrame(d)
df

     names  age state  cgpa
0  shohaib   20    AP    90
1  yuvaraj   30    TN    68
2  gowwwwm   40    MH    45

In [4]:
dict={'name':'ramesh',
      'age':'20',
      'city':'HYD'}
df=pd.DataFrame(dict)
df

ValueError: If using all scalar values, you must pass an index

In [35]:
dict={'name':'ramesh',
      'age':'20',
      'city':'HYD'}
df=pd.DataFrame(dict,index=[0])
df

     name age city
0  ramesh  20  HYD

**step-11 saving the dataframe**

In [36]:
df.to_csv('data.csv')

In [37]:
df.to_excel('data.xlsx')

**step-12 read the dataframes**

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
# in order to read the data 
# fimename.ext
# open(mbox-short.txt).read()
# open(dummy.txt,mode='w').write('hello')

# dataa.csv        data.xlsx
pd.read_csv('data.csv')

   Unnamed: 0    name  age city
0           0  ramesh   20  HYD

In [7]:
df

      name  age state      city
0   ramesh   20    AP     vizag
1   suresh   30    TN  madhurai
2  sathish   40    MH    nagpur

In [8]:
pd.read_excel('data.xlsx')

   Unnamed: 0    name  age city
0           0  ramesh   20  HYD

In [9]:
df=pd.DataFrame()
df['name']=['yuvaraj','shohaib','gowwwtham']
df['age']=[20,30,40]
df['state']=['AP','TN','kl']
df['city']=['vizag','madhurai','kochi']
df

        name  age state      city
0    yuvaraj   20    AP     vizag
1    shohaib   30    TN  madhurai
2  gowwwtham   40    kl     kochi

In [ ]:
df.to_csv
pd.read_csv

pd.to_excel
pd.read_excel

In [10]:
df.to_csv('data1.csv',index=False)

In [11]:
pd.read_csv('data1.csv')

        name  age state      city
0    yuvaraj   20    AP     vizag
1    shohaib   30    TN  madhurai
2  gowwwtham   40    kl     kochi

In [13]:
df.to_excel('data1.xlsx',index=False)

In [14]:
pd.read_excel('data1.xlsx')

        name  age state      city
0    yuvaraj   20    AP     vizag
1    shohaib   30    TN  madhurai
2  gowwwtham   40    kl     kochi

In [15]:
# add one more column marks to df

m=[20,25,45]
df['marks']=m
df

        name  age state      city  marks
0    yuvaraj   20    AP     vizag     20
1    shohaib   30    TN  madhurai     25
2  gowwwtham   40    kl     kochi     45

**step-13 drop the column**

- df.drop(
- labels: 'IndexLabel | None' = None,
  -  *,
   -  axis: 'Axis' = 0,
    - index: 'IndexLabel | None' = None,
    - columns: 'IndexLabel | None' = None,
     - level: 'Level | None' = None,
     - inplace: 'bool' = False,

In [21]:
df.drop(columns='marks')

        name  age state      city
0    yuvaraj   20    AP     vizag
1    shohaib   30    TN  madhurai
2  gowwwtham   40    kl     kochi

In [22]:
df

        name  age state      city  marks
0    yuvaraj   20    AP     vizag     20
1    shohaib   30    TN  madhurai     25
2  gowwwtham   40    kl     kochi     45

In [25]:
df.drop(index=2)

      name  age state      city  marks
0  yuvaraj   20    AP     vizag     20
1  shohaib   30    TN  madhurai     25

In [20]:
df

        name  age state      city  marks
0    yuvaraj   20    AP     vizag     20
1    shohaib   30    TN  madhurai     25
2  gowwwtham   40    kl     kochi     45

In [24]:
df.drop(columns=['city','state'])

        name  age  marks
0    yuvaraj   20     20
1    shohaib   30     25
2  gowwwtham   40     45

In [26]:
df.drop('name',axis=1)

   age state      city  marks
0   20    AP     vizag     20
1   30    TN  madhurai     25
2   40    kl     kochi     45

In [30]:
df.drop(index=2,axis=1)

      name  age state      city  marks
0  yuvaraj   20    AP     vizag     20
1  shohaib   30    TN  madhurai     25

In [31]:
df.drop('state',axis=1)

        name  age      city  marks
0    yuvaraj   20     vizag     20
1    shohaib   30  madhurai     25
2  gowwwtham   40     kochi     45

**in place**

- when we do the operation the result output is not overwriting

- means the original df is same as it is.

- in order to do this we need to use **inplace**

- by default inplace=False

- make **inplace=True** if you want overwrite the result

In [32]:
df.drop('age',axis=1,inplace=True)

In [33]:
df

        name state      city  marks
0    yuvaraj    AP     vizag     20
1    shohaib    TN  madhurai     25
2  gowwwtham    kl     kochi     45

**step-14 rename the column**

In [47]:
d={'name':'NAMES','state':'STATE','marks':'MARKS','city':'CITY',2:'C'}
df.rename(d,axis=0,inplace=True)

In [48]:
df

       NAMES STATE      CITY  MARKS
0    yuvaraj    AP     vizag     20
1    shohaib    TN  madhurai     25
C  gowwwtham    kl     kochi     45

In [59]:
# create one more df
#x=1 to 10
#y= square x
#z=cube x

x=list(range(1,11))
y=[i*i for i in x]
z=[i**3 for i in x]
df=pd.DataFrame(zip(x,y,z),columns=['x','y','z'])
df

    x    y     z
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

In [ ]:
- len

- shape  : df.shape

- size : df.size

- head : df.head

- tail  : df.tail

- isnull  : df.isnull

- dtypes : df.dtypes

- info  : df.info

In [55]:
df

   col1  col2
0     3     4
1     6     7

In [57]:
df = pd.DataFrame({'col1': [1, 2], 'col2': [3, 4]})
df.shape

(2, 2)

In [58]:
df = pd.DataFrame({'col1':[3,6],'col2':[4,7]})
df.shape

(2, 2)

In [56]:
df

   col1  col2
0     3     4
1     6     7

In [60]:
df

    x    y     z
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

In [68]:
len(df)

10

In [63]:
df.dtypes

x    int64
y    int64
z    int64
dtype: object

In [64]:
df.isnull().sum()

x    0
y    0
z    0
dtype: int64

In [65]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   x       10 non-null     int64
 1   y       10 non-null     int64
 2   z       10 non-null     int64
dtypes: int64(3)
memory usage: 372.0 bytes

In [66]:
df.head()

   x   y    z
0  1   1    1
1  2   4    8
2  3   9   27
3  4  16   64
4  5  25  125

In [67]:
df.tail()

    x    y     z
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

In [69]:
df.shape

(10, 3)

In [70]:
df.size

30

**step-15 select a columns**

In [73]:
df.columns

Index(['x', 'y', 'z'], dtype='object')

In [74]:
df['x']

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: x, dtype: int64

In [75]:
df[['x','y']]
# 1d

    x    y
0   1    1
1   2    4
2   3    9
3   4   16
4   5   25
5   6   36
6   7   49
7   8   64
8   9   81
9  10  100

In [77]:
df[['x','y','z']]
# 2d

    x    y     z
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

In [78]:
type(df[['x','y','z']])

pandas.core.frame.DataFrame

In [79]:
type(df[['x','y']])

pandas.core.frame.DataFrame

In [80]:
type(df['x'])

pandas.core.series.Series

In [81]:
df['x'].shape

(10,)

In [82]:
df[['x','y']].shape

(10, 2)

In [83]:
df[['x','y','z']].shape

(10, 3)

In [86]:
df # df
df['x']  # selecting one particular column
df['z'].values  # extracting the data
df['z'].values.tolist()

[1, 8, 27, 64, 125, 216, 343, 512, 729, 1000]

In [85]:
df
df[['x','y']]
df[['x','y','z']].values

array([[   1,    1,    1],
       [   2,    4,    8],
       [   3,    9,   27],
       [   4,   16,   64],
       [   5,   25,  125],
       [   6,   36,  216],
       [   7,   49,  343],
       [   8,   64,  512],
       [   9,   81,  729],
       [  10,  100, 1000]])